Repository: Karolis2011/StrinovaReplayManager
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# SetupIntro.Text
source: Strinova Replay Manager needs permission to create symbolic links in your Demos folder. Enable Developer Mode or restart as administrator.
ja_jp: Strinova Replay Manager は、Demos フォルダーにシンボリックリンクを作成する権限が必要です。開発者モードを有効にするか、管理者として再起動してください。
zh_cn: Strinova 回放管理器需要获得在您的 Demos 文件夹中创建符号链接的权限。请启用开发者模式或以管理员身份重新启动。

# SetupOpenDevSettingsButton.Content
source: Open Developer settings
ja_jp: 開発者設定を開く
zh_cn: 打开开发者设置

# SetupRestartAdminButton.Content
source: Restart as administrator
ja_jp: 管理者として再起動
zh_cn: 以管理员身份重新启动

# SetupRetryButton.Content
source: Retry
ja_jp: 再試行
zh_cn: 重试

# SetupAlwaysElevateCheckbox.Content
source: Always request administrator on startup
ja_jp: 起動時に常に管理者権限を要求する
zh_cn: 启动时始终以管理员身份运行

# SetupViewOnlyButton.Content
source: Continue view-only
ja_jp: 表示のみで続行
zh_cn: 以仅查看模式继续

# MainRemapButton.Label
source: Remap selected
ja_jp: 選択項目をリマップ
zh_cn: 重新映射所选

# MainImportButton.Label
source: Import replay
ja_jp: リプレイをインポート
zh_cn: 导入回放

# MainSaveAsButton.Label
source: Save as…
ja_jp: 名前を付けて保存…
zh_cn: 另存为…

# MainCopyReplayButton.Label
source: Copy replay
ja_jp: リプレイをコピー
zh_cn: 复制回放

# MainRefreshButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Refresh list
ja_jp: リストを更新
zh_cn: 刷新列表

source: Delete slot
ja_jp: スロットを削除
zh_cn: 删除槽位

# MainDeleteSlotButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete slot
ja_jp: スロットを削除
zh_cn: 删除槽位

source: Delete library item
ja_jp: ライブラリ項目を削除
zh_cn: 删除库项目

# MainMappedHeader.Text
source: Mapped replays (newest first)
ja_jp: マップ済みリプレイ（新しい順）
zh_cn: 已映射的回放（最新在前）

# MainOriginalsHeader.Text
source: Originals library — select to save or copy
ja_jp: オリジナルライブラリ — 保存またはコピーする項目を選択
zh_cn: 原始库 — 选择以保存或复制

# MainColumnSlotGroup.Text
source: Slot (in-game)
ja_jp: スロット（ゲーム内）
zh_cn: 槽位（游戏内）

# MainColumnMappedGroup.Text
source: Points to
ja_jp: リンク先
zh_cn: 指向

# MainColumnTime.Text
source: Time
ja_jp: 時刻
zh_cn: 时间

# MainColumnMatchId.Text
source: Match ID
ja_jp: マッチ ID
zh_cn: 比赛 ID

# MainColumnVersion.Text
source: Version
ja_jp: バージョン
zh_cn: 版本

# MainColumnUserId.Text
source: User ID
ja_jp: ユーザー ID
zh_cn: 用户 ID

# MainColumnMappedMatch.Text
source: Mapped match
ja_jp: マップ済みマッチ
zh_cn: 映射的比赛

# MainColumnMappedTime.Text
source: Mapped time
ja_jp: マップ時刻
zh_cn: 映射时间

# MainColumnImported.Text
source: Imported
ja_jp: インポート
zh_cn: 导入时间

# RemapSlotSummaryLabel.Text
source: Slot
ja_jp: スロット
zh_cn: 槽位

# RemapMappedSummaryLabel.Text
source: Currently points to
ja_jp: 現在のリンク先
zh_cn: 当前指向

# RemapTargetHeader.Text
source: Choose new target from Originals library
ja_jp: オリジナルライブラリから新しいリンク先を選択
zh_cn: 从原始库中选择新目标

# RemapApplyButton.Label
source: Apply
ja_jp: 適用
zh_cn: 应用

# RemapCancelButton.Label
source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# Message_SetupIntro
source: Strinova Replay Manager needs permission to create symbolic links in your Demos folder. Enable Developer Mode or restart as administrator.
ja_jp: Strinova Replay Manager は、Demos フォルダーにシンボリックリンクを作成する権限が必要です。開発者モードを有効にするか、管理者として再起動してください。
zh_cn: Strinova 回放管理器需要获得在您的 Demos 文件夹中创建符号链接的权限。请启用开发者模式或以管理员身份重新启动。

# Message_SetupOpenedDevSettings
source: Developer settings opened. Enable Developer Mode, then choose Retry.
ja_jp: 開発者設定を開きました。開発者モードを有効にしてから、再試行を選択してください。
zh_cn: 已打开开发者设置。请启用开发者模式，然后选择重试。

# Message_SetupElevationFailed
source: Could not restart with administrator rights.
ja_jp: 管理者権限で再起動できませんでした。
zh_cn: 无法以管理员权限重新启动。

# Message_SetupProbing
source: Checking symlink capability…
ja_jp: シンボリックリンクの権限を確認しています…
zh_cn: 正在检查符号链接权限…

# Message_SetupProbeFailed
source: Symlinks are still unavailable. Enable Developer Mode or restart as administrator, then retry.
ja_jp: シンボリックリンクはまだ利用できません。開発者モードを有効にするか、管理者として再起動してから再試行してください。
zh_cn: 符号链接仍不可用。请启用开发者模式或以管理员身份重新启动，然后重试。

# Message_MainViewOnlyStatus
source: View-only: select an original to save or copy. Enable symlinks in Setup for full mode.
ja_jp: 表示のみ：オリジナルを選択して保存またはコピーできます。フルモードには設定でシンボリックリンクを有効にしてください。
zh_cn: 仅查看模式：选择原始回放以保存或复制。在设置中启用符号链接以使用完整模式。

# Message_MainFullModeStatus
source: Full mode: select an original to save or copy; select a mapped slot to remap.
ja_jp: フルモード：オリジナルを選択して保存またはコピー；マップ済みスロットを選択してリマップできます。
zh_cn: 完整模式：选择原始回放以保存或复制；选择已映射槽位以重新映射。

# Message_MainViewOnlyImport
source: Import requires full mode with symlink support.
ja_jp: インポートにはシンボリックリンク対応のフルモードが必要です。
zh_cn: 导入需要支持符号链接的完整模式。

# Message_IngestStatus
source: Organized replays: moved {0}, linked {1}.
ja_jp: リプレイを整理しました：{0} 件移動、{1} 件リンク。
zh_cn: 已整理回放：移动 {0} 个，链接 {1} 个。

# Message_ImportSuccessHint
source: Replay imported into Originals library. Remap a game replay slot to use it in-game.
ja_jp: リプレイをオリジナルライブラリにインポートしました。ゲーム内で使用するにはリプレイスロットをリマップしてください。
zh_cn: 回放已导入原始库。重新映射游戏回放槽位即可在游戏中使用。

# Message_ImportUnparsedSuccess
source: Replay imported into Originals library. Its file name could not be parsed; it is shown by file name only.
ja_jp: リプレイをオリジナルライブラリにインポートしました。ファイル名を解析できなかったため、ファイル名のみ表示されます。
zh_cn: 回放已导入原始库。无法解析其文件名；将仅显示文件名。

# Message_ImportCollisionError
source: A file with that name already exists in Originals library.
ja_jp: オリジナルライブラリに同名のファイルが既に存在します。
zh_cn: 原始库中已存在同名文件。

# Message_ImportInvalidNameError
source: Imported file name could not be parsed as a valid replay.
ja_jp: インポートしたファイル名を有効なリプレイとして解析できませんでした。
zh_cn: 导入的文件名无法解析为有效的回放。

# Message_ExportSuccess
source: Exported {0}.
ja_jp: {0} をエクスポートしました。
zh_cn: 已导出 {0}。

# Message_ExportCancelled
source: Export cancelled.
ja_jp: エクスポートをキャンセルしました。
zh_cn: 已取消导出。

# Message_ExportFailed
source: Export failed.
ja_jp: エクスポートに失敗しました。
zh_cn: 导出失败。

# Message_ClipboardSuccess
source: Copied {0} to clipboard.
ja_jp: {0} をクリップボードにコピーしました。
zh_cn: 已将 {0} 复制到剪贴板。

# Message_ClipboardFailed
source: Could not copy replay to clipboard.
ja_jp: リプレイをクリップボードにコピーできませんでした。
zh_cn: 无法将回放复制到剪贴板。

# Message_RemapContext
source: Remap slot {0}. Currently points to {1}.
ja_jp: スロット {0} をリマップします。現在のリンク先：{1}。
zh_cn: 重新映射槽位 {0}。当前指向 {1}。

# Message_RemapSelectTarget
source: Select a replay from the Originals library.
ja_jp: オリジナルライブラリからリプレイを選択してください。
zh_cn: 请从原始库中选择一个回放。

# Message_RemapSuccess
source: Slot {0} now points to {1}.
ja_jp: スロット {0} は {1} を指すようになりました。
zh_cn: 槽位 {0} 现已指向 {1}。

# Message_RemapFailed
source: Remap failed: {0}
ja_jp: リマップに失敗しました：{0}
zh_cn: 重新映射失败：{0}

# Message_GameRunningRemapWarning
source: Strinova is running. Remapping a replay slot that is in use may cause crashes and other issues.
ja_jp: Strinova が実行中です。使用中のリプレイスロットをリマップすると、クラッシュなどの問題が発生する可能性があります。
zh_cn: Strinova 正在运行。重新映射正在使用的回放槽位可能导致崩溃或其他问题。

# Message_GameRunningRemapConfirmTitle
source: Strinova is running
ja_jp: Strinova が実行中です
zh_cn: Strinova 正在运行

# Message_GameRunningRemapConfirm
source: Remapping a replay slot while Strinova is running may cause crashes and other issues. Remap anyway?
ja_jp: Strinova 実行中にリプレイスロットをリマップすると、クラッシュなどの問題が発生する可能性があります。それでもリマップしますか？
zh_cn: 在 Strinova 运行时重新映射回放槽位可能导致崩溃或其他问题。仍要重新映射吗？

# Message_DeleteSlotConfirmTitle
source: Delete slot?
ja_jp: スロットを削除しますか？
zh_cn: 删除槽位？

# Message_DeleteSlotConfirm
source: Delete this slot? The original replay won't be deleted. You will be able to remap it to another slot. If you download the replay again using the game client, the slot will be recreated and the duplicate imported into the Originals library.
ja_jp: このスロットを削除しますか？オリジナルのリプレイは削除されません。別のスロットにリマップできます。ゲームクライアントで再度ダウンロードすると、スロットが再作成され、重複がオリジナルライブラリにインポートされます。
zh_cn: 删除此槽位？原始回放不会被删除。您可以将其重新映射到其他槽位。如果通过游戏客户端再次下载该回放，槽位将被重新创建，重复项会导入原始库。

# Message_DeleteOriginalConfirmTitle
source: Delete from Originals library?
ja_jp: オリジナルライブラリから削除しますか？
zh_cn: 从原始库中删除？

# Message_DeleteOriginalConfirm
source: Old replays can't be redownloaded. Deletion is permanent. Delete this replay from the Originals library?
ja_jp: 古いリプレイは再ダウンロードできません。削除は元に戻せません。このリプレイをオリジナルライブラリから削除しますか？
zh_cn: 旧回放无法重新下载。删除是永久性的。确定要从原始库中删除此回放吗？

# DialogDeleteButtonText
source: Delete
ja_jp: 削除
zh_cn: 删除

# DialogCancelButtonText
source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# DialogProceedButtonText
source: Remap anyway
ja_jp: それでもリマップ
zh_cn: 仍要重新映射

# Message_DeleteSlotSuccess
source: Deleted slot {0}.
ja_jp: スロット {0} を削除しました。
zh_cn: 已删除槽位 {0}。

# Message_DeleteOriginalSuccess
source: Deleted library item {0}.
ja_jp: ライブラリ項目 {0} を削除しました。
zh_cn: 已删除库项目 {0}。

# Message_DeleteFailed
source: Delete failed: {0}
ja_jp: 削除に失敗しました：{0}
zh_cn: 删除失败：{0}
